using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace pair
{
    class Program
    {
        static void Main(string[] args)
        {
            int[] h = 
            {
                173, 0, 179, 155,
                183, 170, 163, 174,
                165, 189, 177, 180,
                154, 170, 170, 173,
                165, 158, 180, 165,
                153, 175, 162, 165,
                0, 160, 165, 173,
                164, 177, 177, 180,
                170, 151, 176, 180,
                168, 152, 185, 173,
                165, 155, 168, 173,
                169, 170, 169, 171,
                0, 170, 150, 160,
                155, 164, 163, 165,
                184, 0, 155, 0,
                168, 160, 169, 0,
                150
            };
            string[] name = 
            {
                "葉俊廷", "張澤瑜", "王程捷", "江儀婷",
                "張秉華", "陳柏霖", "黃紀瑜", "黃昱維",
                "蔡逸群", "登琳", "世新魏鈞孝吧", "劉定南",
                "陳信如", "童信傑", "李岳倫", "鄒和恆",
                "簡毓玟", "劉子瑄", "蕭紹洋", "李亞宸la",
                "張以潔", "邱仕紳", "呂家瑩", "世新林鑫佑",
                "徐均得", "陳佳欣", "張恩瑋", "周詮",
                "王湘婷", "蕭宇成", "Max Cheung(BANG)", "馬嘉誠Σヽ(ﾟД ﾟ; )ﾉ魔貫光殺砲(ﾟДﾟ)σ━0000",
                "陳昱嘉", "康珈熏", "盧奕宏", "陳郁佳的大哥黃博涵",
                "遲正雯", "世新林星彤", "許晏誠ｘ勒是奇多＿８＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝Ｄ　", "許子安",
                "高子晴", "陳思婷", "矝鵘鮿", "余彥廷",
                "吳耀輝", "鄭丞智", "林冠廷", "世新何曜宇",
                "邵喬雨", "張豐愷", "林子晴", "邱雁回",
                "陳家欣是韓妞", "鄧雅馨", "謝汶珊", "李曼寧",
                "世新徐偉哲", "张钰慈", "鍾宜珊", "raer_tsai",
                "世新李姳諼", "鄭曼君", "世新陳柏霖", "世新許子安",
                "世新方若帆"
            };
            string[] no = 
            {
                "A106082026", "A106082016", "A106082062", "A106082054",
                "A104082006", "A106082029", "A106082046", "A106082030",
                "A106082022", "A106082034", "A103082022", "A106082020",
                "A106082011", "A106082024", "A105082201", "A106082010",
                "A106082028", "A106082056", "A106082043", "A106082006",
                "A106082051", "A106082032", "A106082058", "A106082035",
                "A106082017", "A104082036", "A106082009", "A106082007",
                "A106082052", "A106082008", "A106082063", "A106082038",
                "A106082025", "A106082057", "A106082013", "A106082027",
                "A106082048", "A106082036", "A106082059", "A106082045",
                "A106082012", "A106082037", "A106082021", "A106082031",
                "A106082061", "A106082042", "A106082023", "A106082040",
                "A106082001", "A106082002", "A106082014", "A106082041",
                "A106082049", "A106082015", "A106082044", "A106082047",
                "A106082018", "A106082005", "A106082050", "A106082055",
                "A106082039", "A104082013", "A106082029", "",
                "A104040024"
            };
            string[] sex = 
            {
                "男", "男", "男", "女",
                "男", "男", "女", "男",
                "男", "男", "男", "男",
                "女", "男", "男", "男",
                "女", "女", "男", "男",
                "女", "男", "女", "男",
                "男", "女", "男", "男",
                "女", "男", "男", "男",
                "男", "女", "男", "男",
                "女", "女", "男", "男",
                "女", "女", "男", "男",
                "男", "男", "男", "男",
                "女", "男", "女", "女",
                "女", "女", "女", "女",
                "男", "女", "女", "女",
                "女", "女", "男", "男",
                "女"
            };
            Console.ForegroundColor = ConsoleColor.Cyan;
            while (true)
            {
                Console.WriteLine("這是邱比特拿來偷懶的小道具");
                Console.WriteLine("輸入學號吧");
                string num = Console.ReadLine();
                // 宣告查詢的變數，預設為最小值
                int p = -1;

                for (int i = 0; i < no.Length; i++)
                {
                    if (num == no[i])
                    {
                        p = i;
                    }
                }
                if (sex[p] == "男")
                {

                    // 宣告完美身高的公式
                    double hp = h[p] / 1.09;
                    double hpl = hp - 2;
                    double hph = hp + 2;
                    //顯示查詢結果
                    Console.WriteLine("查詢結果: ");
                    Console.WriteLine("第" + p + "位" + " : " + "\n" + "姓名: " + name[p] + "\n" + "性別: " + sex[p] + "\n" + "學號: " + no[p] + " \n" + "身高(公分): " + h[p] + "\n");
                    Console.WriteLine("最適合的交往對象身高為" + hp + "公分");
                    Console.WriteLine("最適合他的對象為");
                    Console.WriteLine("");
                    for (int i = 0; i < no.Length; i++)
                    {
                        if (h[i] < hph && h[i] > hpl && sex[i] == "女")
                        {
                            Console.WriteLine("第" + i + "位:" + name[i] + "、身高 " + h[i] + "公分");
                        }
                    }
                }
                else
                {

                    // 宣告完美身高的公式
                    double hp = h[p] * 1.09;
                    double hpl = hp - 2;
                    double hph = hp + 2;
                    //顯示查詢結果
                    Console.WriteLine("查詢結果: ");
                    Console.WriteLine("第" + p + "位" + " : " + "\n" + "姓名: " + name[p] + "\n" + "性別: " + sex[p] + "\n" + "學號: " + no[p] + " \n" + "身高(公分): " + h[p] + "\n");
                    Console.WriteLine("最適合的交往對象身高為" + hp + "公分");
                    Console.WriteLine("最適合他的對象為");
                    Console.WriteLine("");
                    for (int i = 0; i < no.Length; i++)
                    {
                        if (h[i] < hph && h[i] > hpl && sex[i] == "男")
                            Console.WriteLine("第" + i + "位:" + name[i] + "、身高 " + h[i] + "公分");
                    }
                }
                Console.WriteLine("      -按任意按鈕重新開始-");
                Console.ReadKey();
                Console.Clear();
            }
        }
    }
}
